---
kind: other
id: Properties.T:Autodesk.Revit.DB.TextRange
source: html/662a1f8a-1daf-1cd6-63d3-66511b0f47cf.htm
---
# TextRange Properties

The index of the first character after the end of the range